# FittingParamsCauseGeometryToFailWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..FittingParamsCauseGeometryToFailWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The one of parameters for the fitting is causing the geometry to fail.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FittingParamsCauseGeometryToFailWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FittingParamsCauseGeometryToFailWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FittingParamsCauseGeometryToFailWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace